In [31]:
import pandas as pd

In [32]:
df = pd.DataFrame({'Fare':[25,48,78,85,120,91],
                'embarked':['s','c','s','s','c','q'],
                  'gender':['male','female','female','female','male','male'],
                  'age':[22,34,54,29,55,None]})

In [33]:
df

   Fare embarked  gender   age
0    25        s    male  22.0
1    48        c  female  34.0
2    78        s  female  54.0
3    85        s  female  29.0
4   120        c    male  55.0
5    91        q    male   NaN

Encoder and imputers

In [34]:
from sklearn.preprocessing import LabelEncoder

In [35]:
lab_enc = LabelEncoder()

In [36]:
df2 = lab_enc.fit_transform(df['embarked'])      #here replacing values of s,c,q as 0,1,2
pd.Series(df2)

0    2
1    0
2    2
3    2
4    0
5    1
dtype: int32

In [37]:
df['embarked']  = df2

In [38]:
df

   Fare  embarked  gender   age
0    25         2    male  22.0
1    48         0  female  34.0
2    78         2  female  54.0
3    85         2  female  29.0
4   120         0    male  55.0
5    91         1    male   NaN

In [49]:
from sklearn.preprocessing import OneHotEncoder
from sklearn.impute import SimpleImputer
from sklearn.compose import make_column_transformer

In [50]:
ohe = OneHotEncoder()
si = SimpleImputer()

In [51]:
import pandas as pd

In [52]:
df = pd.DataFrame({'Fare':[25,48,78,85,120,91],
                'embarked':['s','c','s','s','c','q'],
                  'gender':['male','female','female','female','male','male'],
                  'age':[22,34,54,29,55,None]})

In [53]:
df

   Fare embarked  gender   age
0    25        s    male  22.0
1    48        c  female  34.0
2    78        s  female  54.0
3    85        s  female  29.0
4   120        c    male  55.0
5    91        q    male   NaN

In [54]:
ct  = make_column_transformer((ohe,['embarked','gender']),
                             (si,['age']),
        remainder = 'passthrough')                  #remainder is to keep other columns as it is

In [55]:
ct.fit_transform(df)

array([[  0. ,   0. ,   1. ,   0. ,   1. ,  22. ,  25. ],
       [  1. ,   0. ,   0. ,   1. ,   0. ,  34. ,  48. ],
       [  0. ,   0. ,   1. ,   1. ,   0. ,  54. ,  78. ],
       [  0. ,   0. ,   1. ,   1. ,   0. ,  29. ,  85. ],
       [  1. ,   0. ,   0. ,   0. ,   1. ,  55. , 120. ],
       [  0. ,   1. ,   0. ,   0. ,   1. ,  38.8,  91. ]])

In [56]:
df1 = ct.fit_transform(df)

In [57]:
df

   Fare embarked  gender   age
0    25        s    male  22.0
1    48        c  female  34.0
2    78        s  female  54.0
3    85        s  female  29.0
4   120        c    male  55.0
5    91        q    male   NaN

In [58]:
df

   Fare embarked  gender   age
0    25        s    male  22.0
1    48        c  female  34.0
2    78        s  female  54.0
3    85        s  female  29.0
4   120        c    male  55.0
5    91        q    male   NaN

In [59]:
df1

array([[  0. ,   0. ,   1. ,   0. ,   1. ,  22. ,  25. ],
       [  1. ,   0. ,   0. ,   1. ,   0. ,  34. ,  48. ],
       [  0. ,   0. ,   1. ,   1. ,   0. ,  54. ,  78. ],
       [  0. ,   0. ,   1. ,   1. ,   0. ,  29. ,  85. ],
       [  1. ,   0. ,   0. ,   0. ,   1. ,  55. , 120. ],
       [  0. ,   1. ,   0. ,   0. ,   1. ,  38.8,  91. ]])

ORDINAL ENCODER

In [71]:
from sklearn.preprocessing import OrdinalEncoder

In [72]:
import pandas as pd

In [73]:
df = pd.DataFrame({
                'shape':['square','oval','square','circle'],
                  'class':['third','first','second','first'],
                  'size':['m','s','xl','m']})

In [74]:
df

    shape   class size
0  square   third    m
1    oval   first    s
2  square  second   xl
3  circle   first    m

In [75]:
ord_enc = OrdinalEncoder(categories=[['first','second','third'],['s','m','xl']])

In [77]:
df1 = ord_enc.fit_transform(df[['class','size']])

In [78]:
df1

array([[2., 1.],
       [0., 0.],
       [1., 2.],
       [0., 1.]])

In [79]:
df

    shape   class size
0  square   third    m
1    oval   first    s
2  square  second   xl
3  circle   first    m

BINARY ENCODER

In [83]:
import pandas as pd

In [84]:
df = pd.DataFrame({'cat_data':['A','B','C','D','E','F','G','H','I','A','A','D']})

In [85]:
df

   cat_data
0         A
1         B
2         C
3         D
4         E
5         F
6         G
7         H
8         I
9         A
10        A
11        D

In [92]:
pip install category_encoders

Collecting category_encodersNote: you may need to restart the kernel to use updated packages.
  Downloading category_encoders-2.2.2-py2.py3-none-any.whl (80 kB)
Requirement already satisfied: statsmodels>=0.9.0 in c:\users\umarfarooque\anaconda3\lib\site-packages (from category_encoders) (0.12.0)
Requirement already satisfied: numpy>=1.14.0 in c:\users\umarfarooque\anaconda3\lib\site-packages (from category_encoders) (1.19.2)
Requirement already satisfied: patsy>=0.5.1 in c:\users\umarfarooque\anaconda3\lib\site-packages (from category_encoders) (0.5.1)
Requirement already satisfied: pandas>=0.21.1 in c:\users\umarfarooque\anaconda3\lib\site-packages (from category_encoders) (1.1.3)
Requirement already satisfied: scikit-learn>=0.20.0 in c:\users\umarfarooque\anaconda3\lib\site-packages (from category_encoders) (0.23.2)
Requirement already satisfied: scipy>=1.0.0 in c:\users\umarfarooque\anaconda3\lib\site-packages (from category_encoders) (1.5.2)
Requirement already satisfied: six in c:\users\umarfarooque\anaconda3\lib\site-packages (from patsy>=0.5.1->category_encoders) (1.15.0)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\umarfarooque\anaconda3\lib\site-packages (from pandas>=0.21.1->category_encoders) (2.8.1)
Requirement already satisfied: pytz>=2017.2 in c:\users\umarfarooque\anaconda3\lib\site-packages (from pandas>=0.21.1->category_encoders) (2020.1)
Requirement already satisfied: joblib>=0.11 in c:\users\umarfarooque\anaconda3\lib\site-packages (from scikit-learn>=0.20.0->category_encoders) (0.17.0)
Requirement already satisfied: threadpoolctl>=2.0.0 in c:\users\umarfarooque\anaconda3\lib\site-packages (from scikit-learn>=0.20.0->category_encoders) (2.1.0)
Installing collected packages: category-encoders
Successfully installed category-encoders-2.2.2

In [94]:
from category_encoders import BinaryEncoder

In [95]:
bi_enc = BinaryEncoder()

In [96]:
df_bi = bi_enc.fit_transform(df)

C:\Users\UmarFarooque\anaconda3\lib\site-packages\category_encoders\utils.py:21: FutureWarning: is_categorical is deprecated and will be removed in a future version.  Use is_categorical_dtype instead
  elif pd.api.types.is_categorical(cols):

In [97]:
df_bi      #from binary calculation these values has came

    cat_data_0  cat_data_1  cat_data_2  cat_data_3  cat_data_4
0            0           0           0           0           1
1            0           0           0           1           0
2            0           0           0           1           1
3            0           0           1           0           0
4            0           0           1           0           1
5            0           0           1           1           0
6            0           0           1           1           1
7            0           1           0           0           0
8            0           1           0           0           1
9            0           0           0           0           1
10           0           0           0           0           1
11           0           0           1           0           0

##COMPARING WITH ONEHOTENCODER

In [98]:
ohe = OneHotEncoder(sparse = False)
ohe.fit_transform(df[['cat_data']])

array([[1., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 1., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 1., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 1., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 1., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 1., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 1., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 1., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 1., 0., 0., 0., 0., 0.]])

####KNN IMPUTER

In [99]:
df = pd.DataFrame({'Fare':[25,48,78,85,120,91],
                'embarked':['s','c','s','s','c','q'],
                  'gender':['male','female','female','female','male','male'],
                  'age':[22,34,54,29,55,None]})

In [100]:
from sklearn.impute import KNNImputer

In [101]:
knn_ipm = KNNImputer(n_neighbors=2)
knn_ipm.fit_transform(df[['Fare','age']])

array([[ 25. ,  22. ],
       [ 48. ,  34. ],
       [ 78. ,  54. ],
       [ 85. ,  29. ],
       [120. ,  55. ],
       [ 91. ,  41.5]])

#ITERATIVE IMPUTER9PREDICTING

In [105]:
from sklearn.experimental import enable_iterative_imputer

In [106]:
from sklearn.impute import IterativeImputer

In [107]:
df = pd.DataFrame({'Fare':[25,48,78,85,120,91],
                'embarked':['s','c','s','s','c','q'],
                  'gender':['male','female','female','female','male','male'],
                  'age':[22,34,54,29,55,None]})

In [108]:
iter_impute = IterativeImputer()
iter_impute.fit_transform(df[['Fare','age']])

array([[ 25.        ,  22.        ],
       [ 48.        ,  34.        ],
       [ 78.        ,  54.        ],
       [ 85.        ,  29.        ],
       [120.        ,  55.        ],
       [ 91.        ,  43.81062049]])